#include "beep.h"
//#include "PhoneCode.h"
#include "sysport.h"
//#include "includes.h"
/********************************************************************************
  * @file    beep.c
  * @author  晏诚科技  Mr.Wang
  * @version V1.0.0
  * @date    11-Dec-2018
  * @brief   提供蜂鸣器硬件驱动。实现蜂鸣器开关。
  ******************************************************************************
  * @驱动使用方法：
	*  先调用Beep_Init()对蜂鸣器初始化，然后使用驱动相关“对外接口函数"实现蜂鸣器功能
*******************************************************************************/  

/**************************************************************************************************
* 名    称：  void Beep_Init(void)
* 功能说明：  BEEP功能块初始化函数 推挽输出模式
  *************************************************************************************************/
void Beep_Init(void)
{
//		Gpio_Init(BEEP_PORT, BEEP_PIN, GPIO_Mode_Out_PP) ;
}

/**************************************************************************************************
* 名    称：   void Beep_Blink(void)
* 外部引用：   void Wait_For_Nms(u32 nms) ;
* 功能说明：   Beep  鸣——停——鸣
  *************************************************************************************************/
void Beep_Blink(void)
{
	Beep_Reverse() ;
	Wait_For_Nms(400) ;
	Beep_Reverse() ;
 }

 /**************************************************************************************************
* 名    称：   void Beep_Reverse(void)
* 功能说明：   DATA灯翻转
  *************************************************************************************************/
void Beep_Reverse(void)
{
//	Io_Reverse(BEEP_PORT, BEEP_PIN) ;
}

