#ifndef _USER_HTTP_H
#define _USER_HTTP_H
#include "ec20http.h"


/*****************************************
*供外部使用的常变量
****************************************/
extern POSTP_s sReg ;                //注册接口的POSTP_s实例化

/*****************************************
*内部函数声明
****************************************/


/*****************************************
*对外接口函数声明
****************************************/ 
extern RunResult Reg_Post(void) ;   //reg接口提交POST请求，完成硬件注册，同步RTC时间、设置RTC闹钟



#endif
